## プロトコル憲章
### 前文
Edge Licenseの理念に基づき、プロトコルはライセンスを部分的に構成する部品として機能しうることを定義します。

### 第1条（適用）　プロトコルの考え方
- プロトコルは単体で適用するだけでなく、他のプロトコルと組み合わせて、Edge Licenseとして適用することができます。  
- プロトコルの組み合わせは、責務の分離と独立性を維持し、相互に矛盾しない組み合わせが構成されることを理想とします。  
- 各プロトコルは単体で法的効力を保有しますが、Edge Licenseとして組み合わせて、総合的な法的効力を有します。
- プロトコルを適用した、いかなる利用許諾も、プロトコルの遵守を絶対の条件とします。
- プロトコルが他のプロトコルの法的効力を無効化または変更することはできません。

### 第2条（主題）　現行バージョンの運用
プロトコルが更新された場合、バージョン番号によって管理され、旧版と新版は個別に並行運用されます。  
プロトコル使用者は、適用するバージョンを明示し、その条件に従って運用するものとします。  

### 第3条（帰結）　準拠法
本憲章および各プロトコルは日本法に準拠し、これに従って解釈されます。  
本憲章および各プロトコルに関連して生じた紛争は、日本の裁判所の専属管轄とし、第1審の合意管轄裁判所は、提供者の本拠地を管轄する裁判所（または特定の裁判所）とします。
また、翻訳は参考訳であり、正式には日本語版が優先されます。  
